test.txt



M-SEARCH * HTTP/1.1
HOST: 239.255.255.250:1900
MAN: "ssdp:discover"
MX: 1
ST: ssdp:all
USER-AGENT: OS/version UPnP/1.1 product/version



SUBSCRIBE /udp/236.3.6.9:1234 HTTP/1.1
User-Agent: curl/7.24.0 (amd64-portbld-freebsd9.1) libcurl/7.24.0 OpenSSL/0.9.8y zlib/1.2.7 libidn/1.26
Host: 172.16.0.254:80
Accept: */*




POST /upnp/control/ContentDirectory HTTP/1.0
HOST: 172.16.0.254:80
CONTENT-LENGTH: 439
CONTENT-TYPE: text/xml;charset="utf-8"
USER-AGENT: DLNADOC/1.50 SEC_HHP_[TV]UE40D6100/1.0
SOAPACTION: "urn:schemas-upnp-org:service:ContentDirectory:1#Browse"

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Browse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1"><ObjectID>iptv/private/iptv_btk.m3u</ObjectID><BrowseFlag>BrowseDirectChildren</BrowseFlag><Filter>*</Filter><StartingIndex>0</StartingIndex><RequestedCount>1</RequestedCount><SortCriteria></SortCriteria></u:Browse></s:Body></s:Envelope>




POST /control/89c11c71-ba2a-56ee-6fd1-830ff56f149f/ContentDirectory HTTP/1.1
HOST: 172.16.0.254:51900
CONTENT-LENGTH: 415
CONTENT-TYPE: text/xml;charset="utf-8"
USER-AGENT: DLNADOC/1.50 SEC_HHP_[TV]UE40D6100/1.0
SOAPACTION: "urn:schemas-upnp-org:service:ContentDirectory:1#Browse"

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Browse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1"><ObjectID>0</ObjectID><BrowseFlag>BrowseDirectChildren</BrowseFlag><Filter>*</Filter><StartingIndex>0</StartingIndex><RequestedCount>1</RequestedCount><SortCriteria></SortCriteria></u:Browse></s:Body></s:Envelope>



POST /upnp/control/ContentDirectory.php HTTP/1.0
HOST: 172.16.0.254:80
CONTENT-LENGTH: 656
CONTENT-TYPE: text/xml;charset="utf-8"
USER-AGENT: DLNADOC/1.50 SEC_HHP_[TV]UE40D6100/1.0
SOAPACTION: "urn:schemas-upnp-org:service:ContentDirectory:1#Browse"

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Browse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1"><ObjectID>V</ObjectID><BrowseFlag>BrowseDirectChildren</BrowseFlag><Filter>@id,@parentID,@restricted,dc:title,upnp:class,res,dc:date,@childCount,sec:CaptionInfo,sec:CaptionInfoEx, sec:dcmInfo, sec:MetaFileInfo,res@resolution,res@size,upnp:genre,dc:date,upnp:album,res@duration,upnp:albumArtURI,res@bitrate,dc:creator</Filter><StartingIndex>0</StartingIndex><RequestedCount>30</RequestedCount><SortCriteria></SortCriteria></u:Browse></s:Body></s:Envelope>




POST /upnp/control/ContentDirectory.php HTTP/1.1
HOST:172.16.0.254:80
Accept: */*
CONTENT-LENGTH: 313
CONTENT-TYPE: text/xml; charset="utf-8"
USER-AGENT: DLNADOC/1.50 SEC_HHP_[TV] Samsung 8 Series (65)/1.0 UPnP/1.0
SOAPACTION: "urn:schemas-upnp-org:service:ContentDirectory:1#GetSearchCapabilities"
Connection: close

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
<s:Body>
<u:GetSearchCapabilities xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1">
</u:GetSearchCapabilities>
</s:Body>
</s:Envelope>




POST /upnp/control/ContentDirectory.php HTTP/1.1
HOST: 172.16.0.254:80
CONTENT-LENGTH: 485
CONTENT-TYPE: text/xml; charset="utf-8"
SOAPACTION: "urn:schemas-upnp-org:service:ContentDirectory:3#Browse"
USER-AGENT: 6.1.7601 2/Service Pack 1, UPnP/1.0, Portable SDK for UPnP devices/1.6.18

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<s:Body><u:Browse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:3">
<ObjectID>0</ObjectID>
<BrowseFlag>BrowseDirectChildren</BrowseFlag>
<Filter>id,dc:title,res,sec:CaptionInfo,sec:CaptionInfoEx</Filter>
<StartingIndex>0</StartingIndex>
<RequestedCount>0</RequestedCount>
<SortCriteria></SortCriteria>
</u:Browse>
</s:Body>
</s:Envelope>




POST /upnp/control/ContentDirectory.php HTTP/1.1
HOST:172.16.0.254:80
Accept: */*
CONTENT-LENGTH: 445
CONTENT-TYPE: text/xml; charset="utf-8"
USER-AGENT: DLNADOC/1.50 SEC_HHP_[TV] Samsung 8 Series (65)/1.0 UPnP/1.0
SOAPACTION: "urn:schemas-upnp-org:service:ContentDirectory:1#Browse"
Connection: close

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Browse xmlns:u="urn:schemas-upnp-org:service:ContentDirectory:1"><ObjectID>0</ObjectID><BrowseFlag>BrowseMetadata</BrowseFlag><Filter>*</Filter><StartingIndex>0</StartingIndex><RequestedCount>0</RequestedCount><SortCriteria></SortCriteria></u:Browse></s:Body></s:Envelope>



